{
  "id": "008a1102-e610-4493-9885-af1186b45c91",
  "siteName": "BedView Live",
  "domainUrl": "bedviewlive.com",
  "brandingPresets": [
    {
      "presetId": "00000000-e84c-41eb-8dfd-eeb5450e1765",
      "brandIdentity": {
        "designSummary": "**The Data-Driven Command Center**\n\nThe Vision: This platform is the central nervous system for hospital bed management. The design must convey immediate clarity, unwavering reliability, and efficient action. We are not aiming for aesthetic flair that distracts from critical information, but rather a highly functional, intuitive interface that empowers users to make swift, informed decisions. The visual language will be clean, structured, and data-forward, inspired by the precision of control panels and the clarity of modern dashboards.\n\n**Execution Blueprint:**\n1. Grid as a Foundation for Data: A strict 12-column grid will serve as the backbone, ensuring consistent alignment and scannability of critical data points and status indicators.\n2. Typography for Readability: Prioritize highly legible fonts with clear hierarchy. Headings will be bold and commanding, while body text will be clean and concise, optimized for quick scanning of availability and alerts.\n3. Color for Status and Urgency: A restrained palette will be used, with specific accent colors reserved for status indicators (e.g., available, occupied, cleaning, emergency) and real-time alerts, ensuring immediate comprehension of critical information.\n4. Whitespace for Breathing Room: Ample whitespace will be used to prevent information overload, allowing users to focus on the most vital data without feeling overwhelmed.",
        "toneOfVoice": "Professional, authoritative, efficient, reliable, clear, urgent (when necessary).",
        "tones": [
          "professional",
          "efficient",
          "reliable",
          "urgent",
          "clear"
        ],
        "designStyle": {
          "primaryStyle": [
            "Swiss Grid"
          ],
          "supportingStyles": [
            "Clean Modernism",
            "Data Visualization Focus"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#007AFF",
            "primaryForeground": "#FFFFFF",
            "secondary": "#4CAF50",
            "secondaryForeground": "#FFFFFF",
            "background": "#F8F9FA",
            "foreground": "#212529",
            "customColors": [
              {
                "name": "alertRed",
                "value": "#DC3545"
              },
              {
                "name": "alertRedForeground",
                "value": "#FFFFFF"
              },
              {
                "name": "warningYellow",
                "value": "#FFC107"
              },
              {
                "name": "warningYellowForeground",
                "value": "#212529"
              },
              {
                "name": "occupiedBlue",
                "value": "#17A2B8"
              },
              {
                "name": "occupiedBlueForeground",
                "value": "#FFFFFF"
              },
              {
                "name": "availableGreen",
                "value": "#28A745"
              },
              {
                "name": "availableGreenForeground",
                "value": "#FFFFFF"
              },
              {
                "name": "neutralGray",
                "value": "#6C757D"
              },
              {
                "name": "neutralGrayForeground",
                "value": "#FFFFFF"
              },
              {
                "name": "destructive",
                "value": "#DC3545"
              },
              {
                "name": "destructive-foreground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "The background is a light, neutral tone for maximum readability. Primary and secondary colors are used for calls to action and key status indicators. Custom colors are reserved for specific bed statuses (available, occupied, alert, warning) and critical actions like 'destructive'. Ensure high contrast for all text elements.",
          "paletteAccessibilityNotes": "All color combinations for text and background must meet WCAG AA contrast ratios. Specific attention should be paid to status indicators to ensure they are distinguishable by color alone, and also by text labels or icons for accessibility."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "headings",
              "fontFamily": "madefor-display",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [],
            "headingsUsageGuide": "Use for all major titles, section headers, and important callouts. Maintain a clear hierarchy between H1, H2, and H3 tags.",
            "headingsAccessibilityNotes": "Ensure sufficient font size and weight for headings to be easily readable on all devices. Avoid overly decorative or condensed styles for critical headings."
          },
          "paragraphs": {
            "font": {
              "role": "paragraphs",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [],
            "paragraphsUsageGuide": "Use for all body text, descriptions, lists, and detailed information. Maintain consistent line height and letter spacing for optimal readability.",
            "paragraphsAccessibilityNotes": "Paragraph text should be at least 16px (or equivalent rem) with adequate line height (1.5x) and letter spacing to prevent fatigue during extended reading."
          },
          "welcomeSectionTypography": {
            "placement": "",
            "implementation": ""
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.25",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.01em",
              "fontWeight": "500"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.01em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.005em",
              "fontWeight": "600"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.15",
              "letterSpacing": "0.005em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.002em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.001em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.02",
              "letterSpacing": "0",
              "fontWeight": "800"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0",
              "fontWeight": "800"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Structured and information-dense, but with ample whitespace to ensure clarity.",
            "contrastSpectrum": "High contrast for text and data elements against backgrounds, with strategic use of color for status.",
            "gridAlignmentSpectrum": "Strict adherence to a 12-column grid for data organization and layout consistency.",
            "negativeSpaceUsage": "Generous use of whitespace to separate sections and data blocks, preventing cognitive overload.",
            "textVsImageEmphasis": "Emphasis on text and data visualization. Images should be functional (e.g., icons, diagrams) rather than purely decorative.",
            "complexitySpectrum": "Low to moderate complexity, prioritizing ease of use and rapid information retrieval."
          },
          "grid": {
            "compositionApproach": "Strict 12-column grid with clear section breaks and data-focused layouts.",
            "spacing": {
              "columns": "12 columns",
              "rows": "Flexible, based on content",
              "gaps": "Base unit: 8px. All grid gaps are 24px (3x base unit)."
            },
            "margins": "Consistent margins around sections and content blocks.",
            "padding": "Generous padding within containers and around interactive elements."
          },
          "heroSectionLayout": "**Real-Time Hospital Command**\nComposition (Tailwind Spec): Container (h-screen grid place-items-center p-8). Headline 'Real-Time Bed Availability' (text-7xl font-bold text-primary). Subheadline 'Empowering Hospitals with Instant Data' (text-2xl font-medium text-neutral-700 mt-4).\nSignature Hook (Framer Motion Spec): Parent `motion.div` with `initial={{ opacity: 0 }}` and `animate={{ opacity: 1 }}`. Headline `motion.h1` uses `variants` with `transition: { staggerChildren: 0.05 }`. Each letter `span` has a variant with `initial={{ opacity: 0, y: 20 }}` and `animate={{ opacity: 1, y: 0 }}`."
        },
        "components": {
          "containers": "Method: Whitespace, Style: 60px vertical margin between sections. Card-like containers for data modules with subtle borders or shadows.",
          "images": "Layout Role: Functional elements for status indication and data visualization. | Gallery Type: N/A (Images are primarily icons or charts, not galleries).",
          "buttons": "Primary: background-color: #007AFF, color: #FFFFFF, border-radius: 6px, padding: 12px 24px, font-weight: 600. Secondary: background-color: transparent, color: #007AFF, border: 1px solid #007AFF, border-radius: 6px, padding: 12px 24px."
        },
        "graphicElements": {
          "icons": "Clean, minimalist line icons representing status (bed occupied, available, cleaning, emergency), data, and system functions. Icons should be highly legible at small sizes.",
          "illustrations": "Minimal, abstract illustrations that convey efficiency, connectivity, or data flow, used sparingly to enhance visual appeal without distracting from core functionality.",
          "stickers": ""
        }
      },
      "originImagesUrls": [
        "https://static.wixstatic.com/media/595350_91650a8e2f374594a4e155f00123070a~mv2.png"
      ]
    },
    {
      "presetId": "e3803693-24c3-4139-8260-016899e16953",
      "brandIdentity": {
        "designSummary": "This brand design embraces a minimalistic and modern editorial style, characterized by a restrained and professional color palette dominated by soft neutrals and muted pastels. The primary background is a very light grayish-white, complemented by subtle light blue content blocks that create visual separation without overwhelming the user. Typography is elegant and classic, featuring serif fonts for headings that convey sophistication and trustworthiness, paired with clean, readable serif or serif-inspired body text. The layout employs a balanced two-column grid with generous white space, ensuring clarity and ease of navigation. Abstract geometric dot-matrix style graphics subtly reinforce the AI and technology theme, integrated as understated visual motifs. UI elements such as navigation and buttons are minimal and refined, using thin lines and subtle contrasts to maintain the airy and professional aesthetic. Overall, the design communicates a calm, authoritative, and approachable tone suitable for professional consulting and technology sectors.",
        "toneOfVoice": "Professional, calm, authoritative, and approachable with a sophisticated and trustworthy personality.",
        "tones": [
          "calm",
          "professional",
          "trustworthy",
          "minimal",
          "sophisticated",
          "approachable",
          "clean",
          "modern",
          "refined",
          "balanced"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Editorial"
          ],
          "supportingStyles": [
            "Modern",
            "Tech-Inspired"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#B9D6E8",
            "primaryForeground": "#333333",
            "secondary": "#F9FAFB",
            "secondaryForeground": "#333333",
            "background": "#FFFFFF",
            "customColors": [
              {
                "name": "darktext",
                "value": "#333333"
              },
              {
                "name": "buttonborder",
                "value": "#333333"
              },
              {
                "name": "contentblockbackground",
                "value": "#E6F0F6"
              },
              {
                "name": "foreground",
                "value": "#333333"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the main page canvas to maintain a clean and open feel. The 'secondary' color is ideal for large content blocks or sections to create subtle visual separation without heavy contrast. The 'primary' color should be used for accent backgrounds or highlight areas, such as side panels or feature blocks, to add calm emphasis. Text should primarily use 'darkText' for maximum readability on all backgrounds. Buttons and interactive elements should use 'buttonBorder' for outlines and text to maintain a minimal and refined look. The 'contentBlockBackground' can be used for subtle backgrounds behind text or graphics to enhance hierarchy and focus. Combining 'primary' with 'primaryForeground' ensures accessible contrast for headings or callouts, while 'secondary' with 'secondaryForeground' supports body text and secondary content. Overall, colors are balanced to maintain a professional and approachable atmosphere with sufficient contrast for accessibility.",
          "paletteAccessibilityNotes": "The 'primary' color paired with 'primaryForeground' meets WCAG AA standards for large text and UI elements, ensuring readability and accessibility. The 'secondary' color with 'secondaryForeground' also meets WCAG AA contrast ratios for body text and secondary content. The 'darkText' color on 'background' and 'secondary' backgrounds provides strong contrast for all text elements. Button borders and text using 'buttonBorder' on 'secondary' or 'background' maintain clear visibility and interactive affordance. Overall, the palette supports accessible typography and UI components across the site."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "raleway"
            ],
            "headingsUsageGuide": "Use the 'bitter' font for all primary headings to establish a clear hierarchy and refined tone. Headings should be sized prominently with ample line height and letter spacing to enhance readability and elegance. Pair headings with body text fonts that complement serif styles to maintain visual harmony. Use the 'primary' or 'darkText' colors for headings to ensure strong contrast against backgrounds. Avoid overly tight letter spacing to preserve the font's classic character. Headings can be spaced generously from body text to create a balanced and airy layout.",
            "headingsAccessibilityNotes": "Headings in 'bitter' font with 'primaryForeground' or 'darkText' colors on 'primary' or 'background' colors meet WCAG AA contrast standards for all sizes, ensuring clear readability and accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "madefor-display",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "raleway",
              "playfair display",
              "cormorantgaramond"
            ],
            "paragraphsUsageGuide": "Use the 'bitter' font for body text to maintain consistency and a professional appearance. Body text should be sized for comfortable reading with appropriate line height and letter spacing. Use 'darkText' or 'primaryForeground' colors for body text on 'secondary' or 'background' colors to ensure legibility. Maintain sufficient spacing between paragraphs and other elements to avoid clutter. Pair body text with serif headings for a cohesive editorial style. Avoid using body text in all caps or overly decorative styles to preserve clarity.",
            "paragraphsAccessibilityNotes": "Body text in 'bitter' font with 'darkText' or 'primaryForeground' colors on 'secondary' or 'background' colors meets WCAG AA contrast requirements for normal and large text, supporting accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a weighted quadrant layout where the left quadrant is dedicated to large, bold heading text aligned top-left, creating a strong visual anchor. The right quadrant features an abstract geometric graphic that balances the composition. This asymmetrical but balanced placement draws the eye naturally from text to image, emphasizing the message while maintaining visual interest. Generous white space surrounds the elements, enhancing clarity and focus. Typography here is large and prominent, using the 'bitter' font for headings with ample line height and letter spacing to convey authority and sophistication."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.25",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.35",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.015em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.015em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.02em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.025em",
              "fontWeight": "800"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.03em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.035em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Two-column grid with alternating content blocks",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use subtle background color blocks such as 'primary' and 'secondary' to visually separate content areas. They maintain generous padding and margin to ensure content clarity and breathing room. Borders are minimal or absent, relying on color contrast for separation.",
          "images": "Images or graphics are treated as abstract geometric dot-matrix style shapes with monochromatic or muted pastel colors. They integrate seamlessly into the layout as side or background elements, maintaining the minimal and professional aesthetic.",
          "buttons": "Buttons are minimal with thin borders using 'buttonBorder' color and transparent backgrounds. Text inside buttons uses 'darkText' for readability. Hover states may invert colors subtly or increase border weight to indicate interactivity without disrupting the clean design."
        },
        "graphicElements": {
          "icons": "Icons are minimal line-based designs in 'darkText' or 'buttonBorder' colors, consistent with the overall minimal and professional style.",
          "illustrations": "Illustrations are abstract, geometric, and pixelated or dot-matrix style, using monochromatic or muted pastel colors to reinforce the AI and technology theme subtly.",
          "stickers": "No stickers or badges are present; the design avoids decorative elements to maintain a clean and professional look."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752391231198-Screenshot%202025-07-13%20at%209.59.22.png"
      ]
    },
    {
      "presetId": "fc0cf15b-cc15-42c0-a1f9-027a6120b989",
      "brandIdentity": {
        "designSummary": "This design features a minimal and classic aesthetic with a warm, neutral background that creates a soft and inviting canvas. The primary color is a very dark greenish-black used for text and accents, providing a subtle uniqueness over pure black. Pastel color bands in muted lavender and pale blue add gentle color highlights without overpowering the design. Typography is a key element, combining a high-contrast serif font for headings with delicate italic serif accents, conveying formality and refinement. The layout is spacious and balanced, using symmetrical grids and generous negative space to create a calm and structured feel. Thin dividing lines and understated buttons reinforce the elegant minimalism. Images are framed cleanly and used sparingly to maintain focus on content and emotion. Overall, the design communicates a sophisticated, warm, and timeless brand identity suitable for formal and intimate occasions.",
        "toneOfVoice": "Elegant, sophisticated, calm, and intimate with a refined and timeless personality.",
        "tones": [
          "Elegant",
          "Sophisticated",
          "Calm",
          "Intimate",
          "Timeless",
          "Minimal",
          "Warm",
          "Refined",
          "Balanced",
          "Inviting"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Classic",
            "Editorial"
          ],
          "supportingStyles": [
            "Modern Elegance",
            "Refined",
            "Timeless"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#1B2421",
            "primaryForeground": "#F5F3ED",
            "secondary": "#B9AFC9",
            "secondaryForeground": "#1B2421",
            "background": "#F5F3ED",
            "customColors": [
              {
                "name": "pastelblue",
                "value": "#C9D6D5"
              },
              {
                "name": "creamhighlight",
                "value": "#F7F3E9"
              },
              {
                "name": "softgraytext",
                "value": "#4A4A4A"
              },
              {
                "name": "foregroungd",
                "value": "#1B2421"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary canvas for all pages to maintain a soft and warm base. The 'primary' color is ideal for main text, headings, and key UI elements, ensuring strong readability and a sophisticated tone. The 'primaryForeground' color is used for text or icons placed on 'primary' backgrounds to maintain contrast. The 'secondary' color serves as a subtle accent for section backgrounds or highlights, paired with 'secondaryForeground' for text to ensure clarity. Custom colors like 'pastelBlue' and 'creamHighlight' are best used as background bands or highlight blocks to add gentle color variation and visual interest without overwhelming the minimal aesthetic. 'SoftGrayText' is suitable for secondary or body text where a softer tone than 'primary' is desired. Colors should be combined thoughtfully to preserve accessibility and the calm, elegant atmosphere, avoiding overly saturated or bright colors.",
          "paletteAccessibilityNotes": "The 'primary' color on 'background' provides excellent contrast exceeding WCAG AA standards for text readability. The 'secondary' color on 'secondaryForeground' also meets WCAG AA contrast ratios for headings and important text. Custom colors like 'pastelBlue' and 'creamHighlight' used as backgrounds maintain sufficient contrast with 'primary' and 'softGrayText' for body text and UI elements. Button text in 'primaryForeground' on 'primary' backgrounds ensures clear visibility. Overall, the palette supports accessible typography and UI components with careful color role usage."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "playfair display",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "didot-w01-italic",
              "baskervillemtw01-smbdit",
              "cormorantgaramond"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to convey formality and elegance. Pair with italic serif accents for subheadings or decorative text to add refinement. Maintain ample spacing around headings to preserve clarity and balance with body text. Headings should be in the 'primary' color to ensure strong contrast against the 'background'. Avoid using this font for body text to maintain hierarchy and readability.",
            "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' meet WCAG AA contrast standards, ensuring readability for users with visual impairments. Use sufficient font size and weight to maintain accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "playfair display",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "bitter",
              "raleway",
              "open sans"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text and descriptive content. It pairs harmoniously with the heading font, maintaining a consistent serif style while ensuring readability at smaller sizes. Text should primarily use the 'primary' color or 'softGrayText' for secondary content. Maintain line spacing and letter spacing to enhance legibility. Avoid heavy weights or overly decorative styles in paragraphs to keep the tone calm and clear.",
            "paragraphsAccessibilityNotes": "Body text in 'primary' or 'softGrayText' on 'background' meets WCAG AA contrast requirements. Ensure font sizes are not too small to maintain accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a balanced quadrant layout where the main heading is centered vertically and horizontally within the page, flanked by images on either side. This placement creates a strong focal point and symmetry, emphasizing the importance of the message. The typography is large and elegant, with ample negative space around it to enhance readability and impact. Thin vertical lines divide the quadrants, adding structure and refinement. This approach visually anchors the welcome message while maintaining a calm and sophisticated atmosphere."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.015em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.01em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.01em",
              "fontWeight": "800"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.015em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.02em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.025em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Symmetrical Grid",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use soft background colors like 'creamHighlight' or 'pastelBlue' to subtly separate content areas. They have generous padding and maintain clean edges with no heavy borders, supporting the minimal and elegant aesthetic. Text and interactive elements inside containers use the 'primary' or 'softGrayText' colors for clarity.",
          "images": "Images are framed with clean edges and placed symmetrically or in balanced layouts. They are used sparingly to maintain focus on content and emotion, often paired with generous negative space. Images do not have heavy borders or shadows, preserving the refined style.",
          "buttons": "Buttons are understated with thin borders in the 'primary' color and transparent or very light backgrounds. Text inside buttons uses the 'primary' color for consistency. Hover states may invert colors subtly to maintain elegance without harsh contrasts."
        },
        "graphicElements": {
          "icons": "Icons, if used, are minimal line-based designs in the 'primary' color, maintaining the refined and understated style.",
          "illustrations": "No prominent illustrations are present; if used, they would be delicate, minimal line art or soft pastel shapes consistent with the color palette.",
          "stickers": "No stickers or badges are used, preserving the clean and formal aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1753001190179-test%201.png"
      ]
    },
    {
      "presetId": "a2e0d88a-61ed-4879-a4ce-de21b27b7bc3",
      "brandIdentity": {
        "designSummary": "The design features a warm, earthy color palette with soft cream, pale greenish-beige, and deep brown tones that create a natural and elegant atmosphere. Typography plays a central role, with large, classic serif fonts for headings that convey craftsmanship and luxury, paired with clean serif body text for readability. The layout is spacious and balanced, using generous white space and a column-based grid with subtle asymmetry to maintain visual interest. UI components like buttons and containers are minimal and understated, emphasizing simplicity and elegance. The overall aesthetic is timeless and artisanal, suitable for brands that value natural materials and refined presentation.",
        "toneOfVoice": "Sophisticated, warm, artisanal, and refined with a calm and inviting personality.",
        "tones": [
          "calm",
          "sophisticated",
          "warm",
          "natural",
          "elegant",
          "refined",
          "artisanal",
          "timeless",
          "inviting",
          "minimalist"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Luxury",
            "Artisanal"
          ],
          "supportingStyles": [
            "Editorial",
            "Natural",
            "Classic"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#5B3A29",
            "primaryForeground": "#F0EDE6",
            "secondary": "#D9E0B0",
            "secondaryForeground": "#5B3A29",
            "background": "#F0EDE6",
            "customColors": [
              {
                "name": "footerbackground",
                "value": "#2E1B17"
              },
              {
                "name": "linkcolor",
                "value": "#5B3A29"
              },
              {
                "name": "buttonborder",
                "value": "#5B3A29"
              },
              {
                "name": "foreground",
                "value": "#5B3A29"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary page background to create a soft, warm canvas. The 'primary' color is ideal for headings, key text elements, and interactive text such as links and buttons, paired with 'primaryForeground' for contrast on dark backgrounds like the footer. The 'secondary' color serves well for section backgrounds or subtle highlights, with 'secondaryForeground' used for text on these backgrounds to maintain readability. The 'footerBackground' anchors the page footer with a deep, rich tone, contrasting with 'primaryForeground' text for accessibility. The 'linkColor' and 'buttonBorder' colors are used for interactive elements, ensuring they stand out while maintaining the natural, elegant aesthetic. This palette supports a calm, sophisticated atmosphere with strong accessibility and visual harmony.",
          "paletteAccessibilityNotes": "The 'primaryForeground' on 'primary' and 'footerBackground' colors meet WCAG AA contrast standards for large and normal text, ensuring readability. The 'secondaryForeground' on 'secondary' also meets contrast requirements for body text. Links and buttons using 'linkColor' and 'buttonBorder' on 'background' or 'secondary' backgrounds maintain sufficient contrast for accessibility compliance."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "bitter",
              "cormorantgaramond",
              "didot-w01-italic"
            ],
            "headingsUsageGuide": "Use the 'bitter' font for all primary headings to convey sophistication and craftsmanship. Headings should be large, spaced with generous line height to enhance readability and elegance. Pair with body text fonts that are clean and legible to maintain hierarchy and balance. Use the 'primary' color for headings on light backgrounds and 'primaryForeground' on dark backgrounds to ensure contrast and accessibility.",
            "headingsAccessibilityNotes": "Headings in 'primary' on 'background' and 'primaryForeground' on 'footerBackground' meet WCAG AA contrast standards for all sizes, ensuring clear readability."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "madefor-display",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "playfair display",
              "cormorantgaramond-light",
              "raleway"
            ],
            "paragraphsUsageGuide": "Use the 'bitter' font for body text to provide a clean, readable experience that complements the more decorative heading font. Maintain consistent line height and letter spacing for comfortable reading. Text color should be 'primary' on light backgrounds and 'primaryForeground' on dark backgrounds. Avoid overly small font sizes to preserve legibility, especially on mobile devices.",
            "paragraphsAccessibilityNotes": "Body text in 'primary' on 'background' and 'primaryForeground' on 'footerBackground' meets WCAG AA contrast requirements for normal and large text."
          },
          "welcomeSectionTypography": {
            "placement": "Triple Panel Editorial",
            "implementation": "The welcome fold is divided into three distinct vertical panels of differing widths. The far left narrow column features strong branding or logo, often with a bold color background. The central, wider panel presents a powerful visual, such as a photo or artwork, serving as the primary focus. The far right column contains key information, such as event details and a call-to-action button. This layout creates a sophisticated, editorial look and striking asymmetry, drawing the eye to the image first, then to key actions and branding."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.035em",
              "fontWeight": "600"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use subtle background color shifts between 'background' and 'secondary' to delineate sections softly without harsh borders, maintaining a clean and elegant flow. Padding is consistent to ensure content breathes and aligns with the overall spacious layout.",
          "images": "Images are presented with no borders or shadows, emphasizing natural textures and materials. They are integrated into the grid with balanced spacing, often paired side-by-side with text blocks to create harmony and visual interest.",
          "buttons": "Buttons are minimal with thin borders in 'buttonBorder' color and text in 'primary'. They have no heavy backgrounds, maintaining the understated elegance. On hover or focus, the button text or border may darken slightly to indicate interactivity while preserving subtlety."
        },
        "graphicElements": {
          "icons": "Icons are minimal or absent, focusing on typography and photography to convey the brand message. If used, icons would be line-based, simple, and in 'primary' color to maintain consistency.",
          "illustrations": "No illustrations are present; the design relies on photography and typography for visual storytelling.",
          "stickers": "No stickers or badges are used, preserving the clean and sophisticated aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752405607909-Group%201000002186.jpg"
      ]
    }
  ],
  "brandBook": {
    "tones": [
      "professional",
      "efficient",
      "reliable",
      "urgent",
      "clear"
    ],
    "designStyle": {
      "primaryStyle": [
        "Swiss Grid"
      ],
      "supportingStyles": [
        "Clean Modernism",
        "Data Visualization Focus"
      ]
    },
    "toneOfVoice": "Professional, authoritative, efficient, reliable, clear, urgent (when necessary).",
    "components": {
      "images": "Layout Role: Functional elements for status indication and data visualization. | Gallery Type: N/A (Images are primarily icons or charts, not galleries).",
      "buttons": "Primary: background-color: #007AFF, color: #FFFFFF, border-radius: 6px, padding: 12px 24px, font-weight: 600. Secondary: background-color: transparent, color: #007AFF, border: 1px solid #007AFF, border-radius: 6px, padding: 12px 24px.",
      "containers": "Method: Whitespace, Style: 60px vertical margin between sections. Card-like containers for data modules with subtle borders or shadows."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "headings",
          "fontFamily": "madefor-display",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use for all major titles, section headers, and important callouts. Maintain a clear hierarchy between H1, H2, and H3 tags.",
        "headingsSimilarFonts": [],
        "headingsAccessibilityNotes": "Ensure sufficient font size and weight for headings to be easily readable on all devices. Avoid overly decorative or condensed styles for critical headings."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.25",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.5",
          "fontWeight": "500"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.4",
          "fontWeight": "500"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.3",
          "fontWeight": "600"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "0.005em",
          "lineHeight": "1.2",
          "fontWeight": "600"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "0.005em",
          "lineHeight": "1.15",
          "fontWeight": "700"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "0.002em",
          "lineHeight": "1.1",
          "fontWeight": "700"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "0.001em",
          "lineHeight": "1.05",
          "fontWeight": "700"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "0",
          "lineHeight": "1.02",
          "fontWeight": "800"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "0",
          "lineHeight": "1",
          "fontWeight": "800"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "0",
          "lineHeight": "1",
          "fontWeight": "900"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "paragraphs",
          "fontFamily": "open sans",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use for all body text, descriptions, lists, and detailed information. Maintain consistent line height and letter spacing for optimal readability.",
        "paragraphsSimilarFonts": [],
        "paragraphsAccessibilityNotes": "Paragraph text should be at least 16px (or equivalent rem) with adequate line height (1.5x) and letter spacing to prevent fatigue during extended reading."
      },
      "welcomeSectionTypography": {
        "placement": "",
        "implementation": ""
      }
    },
    "originImagesUrls": [
      "https://static.wixstatic.com/media/595350_91650a8e2f374594a4e155f00123070a~mv2.png"
    ],
    "layout": {
      "grid": {
        "margins": "Consistent margins around sections and content blocks.",
        "padding": "Generous padding within containers and around interactive elements.",
        "spacing": {
          "gaps": "Base unit: 8px. All grid gaps are 24px (3x base unit).",
          "rows": "Flexible, based on content",
          "columns": "12 columns"
        },
        "compositionApproach": "Strict 12-column grid with clear section breaks and data-focused layouts."
      },
      "layoutDna": {
        "contrastSpectrum": "High contrast for text and data elements against backgrounds, with strategic use of color for status.",
        "densitySpectrum": "Structured and information-dense, but with ample whitespace to ensure clarity.",
        "textVsImageEmphasis": "Emphasis on text and data visualization. Images should be functional (e.g., icons, diagrams) rather than purely decorative.",
        "complexitySpectrum": "Low to moderate complexity, prioritizing ease of use and rapid information retrieval.",
        "gridAlignmentSpectrum": "Strict adherence to a 12-column grid for data organization and layout consistency.",
        "negativeSpaceUsage": "Generous use of whitespace to separate sections and data blocks, preventing cognitive overload."
      },
      "heroSectionLayout": "**Real-Time Hospital Command**\nComposition (Tailwind Spec): Container (h-screen grid place-items-center p-8). Headline 'Real-Time Bed Availability' (text-7xl font-bold text-primary). Subheadline 'Empowering Hospitals with Instant Data' (text-2xl font-medium text-neutral-700 mt-4).\nSignature Hook (Framer Motion Spec): Parent `motion.div` with `initial={{ opacity: 0 }}` and `animate={{ opacity: 1 }}`. Headline `motion.h1` uses `variants` with `transition: { staggerChildren: 0.05 }`. Each letter `span` has a variant with `initial={{ opacity: 0, y: 20 }}` and `animate={{ opacity: 1, y: 0 }}`."
    },
    "graphicElements": {
      "icons": "Clean, minimalist line icons representing status (bed occupied, available, cleaning, emergency), data, and system functions. Icons should be highly legible at small sizes.",
      "stickers": "",
      "illustrations": "Minimal, abstract illustrations that convey efficiency, connectivity, or data flow, used sparingly to enhance visual appeal without distracting from core functionality."
    },
    "designSummary": "**The Data-Driven Command Center**\n\nThe Vision: This platform is the central nervous system for hospital bed management. The design must convey immediate clarity, unwavering reliability, and efficient action. We are not aiming for aesthetic flair that distracts from critical information, but rather a highly functional, intuitive interface that empowers users to make swift, informed decisions. The visual language will be clean, structured, and data-forward, inspired by the precision of control panels and the clarity of modern dashboards.\n\n**Execution Blueprint:**\n1. Grid as a Foundation for Data: A strict 12-column grid will serve as the backbone, ensuring consistent alignment and scannability of critical data points and status indicators.\n2. Typography for Readability: Prioritize highly legible fonts with clear hierarchy. Headings will be bold and commanding, while body text will be clean and concise, optimized for quick scanning of availability and alerts.\n3. Color for Status and Urgency: A restrained palette will be used, with specific accent colors reserved for status indicators (e.g., available, occupied, cleaning, emergency) and real-time alerts, ensuring immediate comprehension of critical information.\n4. Whitespace for Breathing Room: Ample whitespace will be used to prevent information overload, allowing users to focus on the most vital data without feeling overwhelmed.",
    "palette": {
      "colors": {
        "background": "#F8F9FA",
        "secondary": "#4CAF50",
        "customColors": [
          {
            "name": "alertRed",
            "value": "#DC3545"
          },
          {
            "name": "alertRedForeground",
            "value": "#FFFFFF"
          },
          {
            "name": "warningYellow",
            "value": "#FFC107"
          },
          {
            "name": "warningYellowForeground",
            "value": "#212529"
          },
          {
            "name": "occupiedBlue",
            "value": "#17A2B8"
          },
          {
            "name": "occupiedBlueForeground",
            "value": "#FFFFFF"
          },
          {
            "name": "availableGreen",
            "value": "#28A745"
          },
          {
            "name": "availableGreenForeground",
            "value": "#FFFFFF"
          },
          {
            "name": "neutralGray",
            "value": "#6C757D"
          },
          {
            "name": "neutralGrayForeground",
            "value": "#FFFFFF"
          },
          {
            "name": "destructive",
            "value": "#DC3545"
          },
          {
            "name": "destructive-foreground",
            "value": "#FFFFFF"
          }
        ],
        "foreground": "#212529",
        "secondaryForeground": "#FFFFFF",
        "primaryForeground": "#FFFFFF",
        "primary": "#007AFF"
      },
      "paletteUsageGuide": "The background is a light, neutral tone for maximum readability. Primary and secondary colors are used for calls to action and key status indicators. Custom colors are reserved for specific bed statuses (available, occupied, alert, warning) and critical actions like 'destructive'. Ensure high contrast for all text elements.",
      "paletteAccessibilityNotes": "All color combinations for text and background must meet WCAG AA contrast ratios. Specific attention should be paid to status indicators to ensure they are distinguishable by color alone, and also by text labels or icons for accessibility."
    }
  },
  "initialPrompt": "a site for real time bed availability for hospital",
  "status": "READY",
  "revision": "10",
  "createdDate": "2026-01-16T19:14:15.715Z",
  "updatedDate": "2026-01-16T19:14:42.998Z",
  "attachments": {
    "contentImagesUrls": [
      "https://static.wixstatic.com/media/595350_91650a8e2f374594a4e155f00123070a~mv2.png"
    ],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "00000000-e84c-41eb-8dfd-eeb5450e1765",
  "plan": "\n\n```json\n{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This site provides real-time bed availability information for a hospital, allowing visitors to view current bed status across different departments and room types.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **Bed Availability Listing**: View real-time bed availability across all hospital departments.\\n- **Filter Bed Availability**: Filter beds by department, room type, or availability status.\\n- **Bed Detail View**: View detailed information about a specific bed or room.\",\n      \"metadata\": [\n        { \"id\": \"bed-availability-listing\", \"name\": \"Bed Availability Listing\" },\n        { \"id\": \"filter-bed-availability\", \"name\": \"Filter Bed Availability\" },\n        { \"id\": \"bed-detail-view\", \"name\": \"Bed Detail View\" }\n      ]\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Header (Reusable)**: Contains hospital name and navigation links.\\n- **Bed Availability Page**: Displays real-time bed availability with filtering options and detailed bed information.\\n- **Footer (Reusable)**: Contains hospital contact information and links.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"bed-availability-listing\", \"name\": \"Bed Availability Listing\" },\n        { \"id\": \"filter-bed-availability\", \"name\": \"Filter Bed Availability\" },\n        { \"id\": \"bed-detail-view\", \"name\": \"Bed Detail View\" }\n      ]\n    }\n  ],\n  \"version\": \"4.0.0\"\n}\n```",
  "designerData": {
    "designerId": "45d286a9-c2d3-4558-807d-a3f26205dc86",
    "designerName": "Elise",
    "selectionMethod": "UNSELECTED"
  }
}